Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЦеныНоменклатуры(ДокументСсылкаУстановкаЦенНоменклатуры, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаЦены.ТипЦен КАК ТипЦены,
		|	ВременнаяТаблицаЦены.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаЦены.Цена КАК Цена,
		|	ВременнаяТаблицаЦены.Период КАК Период
		|ИЗ
		|	ВременнаяТаблицаЦены КАК ВременнаяТаблицаЦены";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЦеныНоменклатуры", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЦеныНоменклатуры()

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУстановкаЦенНоменклатуры, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыЗапасы.Ссылка.ТипЦен КАК ТипЦен,
		|	УстановкаЦенНоменклатурыЗапасы.Номенклатура,
		|	УстановкаЦенНоменклатурыЗапасы.Цена,
		|	УстановкаЦенНоменклатурыЗапасы.Ссылка.Дата КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаЦены
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.Запасы КАК УстановкаЦенНоменклатурыЗапасы
		|ГДЕ
		|	УстановкаЦенНоменклатурыЗапасы.Ссылка = &Ссылка
		|	И УстановкаЦенНоменклатурыЗапасы.Пометка = ИСТИНА";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУстановкаЦенНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицаЦеныНоменклатуры(ДокументСсылкаУстановкаЦенНоменклатуры, СтруктураДополнительныеСвойства);
	
КонецПроцедуры
